# 분산분석(ANOVA)
# 2개 이상의 여러 모집단 간의 평균의 동일성을 검정
# 일원분산분석, 이원분산분석, 공분산분석, 반복측정 분산분석, 다변량 분산분석

## 일원분산분석(One way ANOVA) ##
# 집단을 구분하는 범주형 변수가 1개인 경우

# 집단 간 일원분산분석
# ex) 심리치료 방법별 ADHD 평가점수 차이

# 집단 내 일원분산분석
# ex) 기간별 ADHD 평가점수 차이 == 반복측정 분산분석

## 이원분산분석(Two way ANOVA) ##
# 집단을 구분하는 범주형 변수가 2개인 경우
# ex) 심리치료 방법과 기간에 따른 ADHD 평가점수 차이 == 반복측정 분산분석
# 심리치료, 기간 -> 주효과
# 심리치료x기간 -> 상호작용 효과

## 공변량(공분산) 분석(ANCOVA) ##
# 독립변수와 종속변수에 영향을 미치는 또 다른 변수(공변량)를 통제하여 독립변수와 종속변수의 순수한 차이를 확인
# ex) 스트레스 수준을 통제하고 심리치료에 따른 ADHD 평가점수 차이를 확인

## 다변량 분산분석(MANOVA) ##
# 2개 이상의 종속변수를 포함


## 다변량 공분산분석(MANCOVA) ##
# 다변량 분산분석에 공변량이 추가